export const teachers = [
    {
        name: 'Артур Пирожков Львович',
        description: 'Суперский и опытный учитель'
    },
    {
        name: 'Артур Пирожков Львович',
        description: 'Суперский и опытный учитель'
    },
    {
        name: 'Артур Пирожков Львович',
        description: 'Суперский и опытный учитель'
    },
    {
        name: 'Артур Пирожков Львович',
        description: 'Суперский и опытный учитель'
    },
    {
        name: 'Артур Пирожков Львович',
        description: 'Суперский и опытный учитель'
    },
    {
        name: 'Артур Пирожков Львович',
        description: 'Суперский и опытный учитель'
    },
    {
        name: 'Артур Пирожков Львович',
        description: 'Суперский и опытный учитель'
    },
    {
        name: 'Артур Пирожков Львович',
        description: 'Суперский и опытный учитель'
    }
]