import { useRouter } from "next/router";
import styles from "./law.module.scss";

export default function Agreement() {
  const router = useRouter();
  return (
    <>
      <button onClick={() => router.push("/")}>на главную</button>
      <div className={styles.container}>
        <div>ПУБЛИЧНЫЙ ДОГОВОР-ОФЕРТА</div>
        <div>Юридического лица _ИП Муханов </div>
        <div>(далее – Исполнитель)</div>
        <div>
          Настоящая публичная оферта (далее – Оферта), является Договором,
          заключенным между Исполнителем и пользователем услуг - физическим
          лицом (далее - Заказчик), который определяет условия приобретения и
          оказания услуг с использованием ресурсов Исполнителя.
        </div>
        <div>1. ОБЩИЕ ПОЛОЖЕНИЯ</div>
        1.1. Исполнитель публикует настоящую Оферту с предложением в адрес
        физических и юридических лиц в соответствии со ст.395, 396 и 447
        Гражданского кодекса Республики Казахстан (далее – ГК РК). 1.2.
        Настоящая Оферта, как и любой Договор, определяет существенные условия
        взаимодействия между Исполнителем и Заказчиком (лицом акцептовавшим
        Оферту). 1.3. Настоящая Оферта заключается между Исполнителем и
        Заказчиком в момент оформления заказа на оказание услуг. 1.4. Оферта
        может быть принята любым физическим или юридическим лицом на территории
        Республики Казахстан, имеющим намерение заказать (приобрести) услуги,
        оказываемые Исполнителем в соответствии с перечнем услуг, указанных на
        сайте langy.su. 1.5. Заказчик безоговорочно принимает все условия,
        содержащиеся в оферте в целом (т.е. в полном объеме и без исключений).
        1.6. В случае принятия условий настоящей Оферты, физическое или
        юридическое лицо, становится Заказчиком. 1.7. Акцептом является
        получение Исполнителем сообщения о намерении физического или
        юридического лица заказать услуги на условиях, предложенных настоящей
        Офертой. 1.8. Оферта, все изменения, приложения к ней, а также вся
        дополнительная информация об услугах Исполнителя опубликованы на сайте
        langy.su.
        <div>2. СТАТУС САЙТА ИСПОЛНИТЕЛЯ</div>
        2.1. Сайт является собственностью Исполнителя и предназначен для
        организации дистанционного способа продажи услуг посредством сети
        интернет. 2.2. Произведя акцепт Оферты (т.е. оплату оформленного на
        сайте Исполнителя заказа), Заказчик получит услуги на условиях и в
        порядке, определенном Договором на оказание услуг Исполнителя,
        размещенного на сайте langy.su. 2.3. Исполнитель не несет
        ответственности за содержание и достоверность информации,
        предоставленной Заказчиком при оформлении заказа на сайте Исполнителя.
        <div>3. СТАТУС ЗАКАЗЧИКА</div>
        3.1. Заказчик несет ответственность за достоверность предоставленной при
        оформлении заказа информации, и ее чистоту от претензий третьих лиц.
        3.2. Заказчик подтверждает свое согласие с условиями, установленными
        настоящей Офертой, путем покупки подписки на сайте langy.su. 3.3.
        Информация, предоставленная Заказчиком, является конфиденциальной.
        Заказчик, предоставляя свои персональные данные, зарегистрировавшись на
        сайте или заполнении заявки дает своими действиями согласие на обработку
        его персональных данных в целях исполнения пользовательского соглашения.
        Исполнитель использует информацию о Заказчике исключительно в целях
        функционирования Исполнителя (отправление уведомления Заказчиком о
        выполнении заказа и т.д.) и в случаях, указанных в настоящей Оферте.
        3.4. Услуги приобретаются Заказчиком исключительно для личных, семейных,
        домашних нужд, не связанных с осуществлением предпринимательской
        деятельности. Использование сайта (ресурса) Исполнителя для просмотра и
        выбора услуг, а так же для оформления заказа является для Заказчика
        безвозмездным.
        <div>4. ПРЕДМЕТ ОФЕРТЫ</div>
        4.1. Исполнитель, на основании заказов Заказчика, продает последнему
        услуги в соответствии с условиями и по ценам, установленным Исполнителем
        на сайте. 4.2. Оказание услуг заказанных и оплаченных Заказчиком,
        осуществляется Исполнителем или третьими лицами, привлеченными
        Исполнителем для исполнения своих обязательств. 4.3. К отношениям между
        Заказчиком и Исполнителем применяются положения ГК РК, ЗРК «О защите
        прав потребителей», а также иные нормативные правовые акты Республики
        Казахстан, регулирующие указанные в настоящей Оферте права и обязанности
        Сторон. 4.4. Физическое или юридическое лицо считается принявшим все
        условия Оферты (акцепт) и приложений к ней в полном объеме и без
        исключений с момента получения Исполнителем сообщения о намерении
        Заказчика заказать услуги на условиях, предложенных Исполнителем. В
        случае акцепта Оферты физическое или юридическое лицо считается
        заключившим с Исполнителем Договор оказания услуг и приобретает статус
        Заказчика.
        <div>5. ИНФОРМАЦИЯ ОБ УРОКАХ</div>
        5.1. Информация об услугах Исполнителя, предоставляются к показу на
        сайте Исполнителя через графические изображения и информацию, являющиеся
        собственностью Исполнителя. 5.2. Заказчик может ознакомиться со
        структурой уроков через прохождение бесплатного урока после регистрации
        на сайте. 5.3. Все информационные материалы, представленные на сайте
        Исполнителя, носят справочный характер и не могут в полной мере
        передавать все нюансы английского языка.
        <div>6. ПОРЯДОК ПРИОБРЕТЕНИЯ (ЗАКАЗА) УСЛУГ</div>
        6.1. Заказчик вправе приобрести подписку на 3 или 6 месяцев пройдя
        процедуру оплаты на сайте langy.su. 6.2. После оформления заказа
        Исполнитель подтверждает заказ Заказчика путем отправления на e-mail
        Заказчика информацию, подтверждающую принятие заказа, с указанием
        наименования, вида и характеристик услуг с указанием общей суммы заказа
        и открытием последующих уроков. 6.3. Срок оказания услуги
        устанавливается по соглашению Сторон и/или определяется Договором об
        оказании услуг, размещенном на сайте Исполнителя.
        <div>7. ЦЕНА УСЛУГ</div>
        7.1. Цена указанная на сайте Исполнителя указана в тенге Республики
        Казахстан. 7.2. Указанная на сайте цена может быть изменена Исполнителем
        в одностороннем порядке, при этом цена на заказанные и оплаченные
        Заказчиком услуги изменению не подлежит. 7.3. Стоимость услуг,
        предоставляемых Заказчику при их заказе на сайте Исполнителя указана на
        странице «подписок – langy.su/subscription»
        <div>8. ОПЛАТА УСЛУГ</div>
        8.1. Заказчик оплачивает заказ любым способом, доступным на сайте
        Исполнителя. 8.2. Расчеты Сторон при оплате заказа осуществляются в
        тенге Республики Казахстан.
        <div>9. ОТВЕТСТВЕННОСТЬ СТОРОН</div>
        9.1. Стороны несут ответственность в соответствии с законодательством
        РК. 9.2. Исполнитель не несет ответственности за ущерб, причиненный
        Заказчику вследствие ненадлежащего использования им результатов услуг,
        заказанных на сайте Исполнителя. 9.3. Стороны освобождаются от
        ответственности за неисполнение или ненадлежащее исполнение обязательств
        по Оферте на время действия обстоятельств непреодолимой силы.
        <div>10. ПРОЧИЕ УСЛОВИЯ</div>
        10.1. К отношениям между Заказчиком и Исполнителем применяются нормы,
        определенные законодательством Республики Казахстан. 10.2. В случае
        возникновения вопросов и претензий со стороны Заказчика, последний
        должен обратиться к Исполнителю заполнив форму службы поддержки на сайте
        langy.su. 10.3. Настоящая Оферта вступает в силу с даты её акцепта
        Заказчиком и действует до полного исполнения обязательств Сторонами по
        ней. 10.4. Все споры и разногласия, возникающие при исполнении Сторонами
        обязательств по настоящей Оферте, решаются путем проведения переговоров,
        а в случае невозможности их урегулирования посредством переговоров,
        Стороны имеют право обратиться за разрешением таких споров в судебные
        органы республики Казахстан по месту нахождения Исполнителя. 10.5.
        Исполнитель оставляет за собой право расширять и сокращать общее
        предложение услуг на сайте, регулировать доступ к заказе любых услуг, а
        также приостанавливать или прекращать продажу любых услуг по своему
        собственному усмотрению.
        <div>11. АДРЕС И РЕКВИЗИТЫ ИСПОЛНИТЕЛЯ</div>
        Наименование: ИП Муханов Юридический адрес: г. Актобе жилой массив
        Жанаконыс ул. Оркен 6 БИН: 860530301404 р/с в тенге:
        KZ59601A121008238831 в банке: Народный Банк Казахстана БИК: HSBKKZKX БИН
        банка: 940140000385 ОКПО: 30722009
      </div>
    </>
  );
}
