import styles from "./law.module.scss";
import { useRouter } from "next/router";

export default function Confidentiality() {
  const router = useRouter();
  return (
    <>
      <button onClick={() => router.push("/")}>на главную</button>
      <div className={styles.container}>
        <div>Политика конфиденциальности персональных данных</div>
        <div>
          Настоящая Политика конфиденциальности персональных данных (далее –
          Политика конфиденциальности) является публичным Договором, заключенным
          между владельцем сайте langy.su ИП Муханов (Продавец) и Покупателем в
          соответствии со ст.387 Гражданского кодекса Республики Казахстан,
          основана на Законе Республики Казахстан «О персональных данных и их
          защите», действует в отношении информации, содержащей персональные
          данные Покупателей, которую сайт https:// langy.su (далее – langy.su)
          может получить о Покупателях во время пользования ими сайтом langy.su.
        </div>
        <div>1. Определение терминов</div>
        1.1. Персональные данные - сведения, относящиеся к определенному или
        определяемому на их основании субъекту персональных данных,
        зафиксированные на электронном, бумажном и (или) ином материальном
        носителе. 1.2. Неличные данные - сведения, которые автоматически
        передаются в процессе просмотра Покупателем рекламных блоков и при
        посещении страниц, на которых установлен статистический скрипт системы:
        адрес запрашиваемой страницы, информацию cookie, IP-адрес, информацию о
        браузере, реферер (адрес предыдущей страницы), время доступа. 1.3. Сбор
        персональных данных - действия, направленные на получение персональных
        данных. 1.4. Обработка персональных данных - действия, направленные на
        накопление, хранение, изменение, дополнение, использование,
        распространение, обезличивание, блокирование и уничтожение персональных
        данных. 1.5. Защита персональных данных - комплекс мер, в том числе
        правовых, организационных и технических, осуществляемых в целях,
        установленных Законом РК «О персональных данных и их защите». 1.6.
        Интернет-сайт langy.su, расположенный на сервере в г. Алматы и имеющий
        адрес в сети Интернет https:// langy.su, на котором размещен курс
        анлийского языка, а также условия оплаты и предоставления подписки
        пользователям. 1.7. Сервисы Интернет-сайта – все услуги, доступные для
        использования на сайте https:// langy.su и поддоменах. 1.8. Покупатель –
        пользователь Интернет-сайта langy.su. 1.9. Продавец – ИП Муханов,
        являющееся владельцем Интернет-сайта langy.su, ИИН 870429402431. 1.10.
        Cookies — это небольшие текстовые файлы, в которые браузер записывает
        данные с посещенных Покупателями сайтов. Cookies исполняют целый ряд
        функций, например, позволяют Покупателю эффективно перемещаться между
        страницами, запоминая его предпочтения, и, таким образом, улучшает опыт
        взаимодействия с Интернет-сайтом. Они также могут способствовать тому,
        что реклама, которую видит Покупатель онлайн, соответствует его
        интересам. Если не использовать cookies, то не возможно будет проходить
        обучение на сайте langy.su, так как вся работа сайта построена на
        сохранении данных с этих файлов. 1.11. IP-адрес — уникальный сетевой
        адрес узла в компьютерной сети, построенной по протоколу IP, позволяющий
        определить местонахождение Покупателя. Интернет-сайт langy.su не
        отслеживает местоположение, подробнее чем город и область.
        <div>2. Предмет политики конфиденциальности</div>
        2.1. Настоящая Политика конфиденциальности устанавливает обязательства
        Продавца по неразглашению и обеспечению режима защиты конфиденциальности
        персональных данных, которые Покупатель предоставляет по запросу
        langy.su при регистрации на сайте langy.su и/или при оформлении заказа
        для приобретения подписки. 2.2. Персональные данные, разрешённые к
        обработке в рамках настоящей Политики конфиденциальности,
        предоставляются Покупателем путём заполнения регистрационной формы на
        сайте langy.su и включают в себя следующую информацию: 2.2.1. фамилию,
        имя, отчество (отчество – по желанию) Покупателя; 2.2.2. контактный
        телефон Покупателя; 2.2.3. адрес электронной почты (e-mail); 2.3. Любая
        иная персональная информация неоговоренная выше (история покупок,
        используемые браузеры и операционные системы и т.д.) также подлежит
        надежному хранению и нераспространению, за исключением случаев,
        предусмотренных в п.4.3.2. и п.4.4. настоящей Политики
        конфиденциальности.
        <div>3. Цели сбора и обработки персональных данных Покупателей</div>
        3.1. Продавец собирает, обрабатывает и хранит только те персональные
        данные, которые необходимы для предоставления Сервисов. 3.2.
        Персональные данные Покупателя Продавец использует в целях: 3.2.1.
        идентификации Покупателя для оформления заказа и/или заключения Договора
        купли-продажи товара; 3.2.2. обработки и получения от Покупателя
        платежей; 3.2.4. предоставления Покупателю эффективной клиентской
        поддержки; 3.2.5. предоставления Покупателю персонализированных
        Сервисов; 3.2.6. связи с Покупателем, в том числе направление
        уведомлений, запросов и информации, касающихся использования Сервисов,
        оказания услуг, а также обработки запросов и заявок от Покупателя;
        3.2.7. улучшения качества Сервисов, удобства их использования,
        разработка новых Сервисов и услуг; 3.2.8. информирования Покупателя о
        проводимых мероприятиях и акциях; 3.2.9. проведения статистических и
        иных исследований на основе неличных данных, а также оптимизации
        рекламных сообщений. 3.3. Продавец не несет ответственности за сведения,
        предоставленные Покупателем на интернет-сайте в общедоступной форме.
        3.4. Продавец не несет ответственности за убытки, которые Покупатель
        может понести в результате того, что его логин и пароль стали известны
        третьему лицу.
        <div>4. Права и обязанности сторон</div>
        4.1. Покупатель обязан: 4.1.1. предоставлять информацию о персональных
        данных, необходимую для пользования Интернет-сайтом; 4.1.2. изменять,
        дополнять предоставленную информацию в случае обнаружения некорректных
        данных при пользовании Интернет- сайтом. 4.2. Покупатель имеет право:
        4.2.1. на доступ и редактирование информации о персональных данных в
        любое время через веб-интерфейс, предоставляемый в рамках сервисов. 4.3.
        Продавец обязан: 4.3.1. использовать полученную информацию исключительно
        для целей, указанных в разделе 3 настоящей Политики конфиденциальности;
        4.3.2. обеспечить хранение конфиденциальной информации в тайне, не
        разглашать без предварительного письменного разрешения Покупателя
        переданных персональных данных, а также уполномоченным государственным
        органам Республики Казахстан в порядке, установленным законодательством
        РК; 4.3.3. принимать меры предосторожности для защиты конфиденциальности
        персональных данных Покупателя согласно порядку, обычно используемого
        для защиты такого рода информации. 4.4. Продавец имеет право
        предоставлять доступ для сбора и анализа неличных данных Покупателей
        третьим лицам для целей статистики и оптимизации рекламных сообщений.
        Использование неличных данных третьими лицами регулируется их
        собственными политиками конфиденциальности, и Интернет-сайт langy.su не
        несет ответственности за их использование.
        <div>5. Прочие условия</div>
        5.1. Пользование Покупателем Интернет-сайтом langy.su означает его
        безоговорочное согласие с настоящей Политикой конфиденциальности и
        условиями обработки Продавцом персональных данных Покупателя. 5.2. В
        случае несогласия с условиями Политики конфиденциальности Покупатель
        должен прекратить пользование Сайтом langy.su. 5.3. Настоящая Политика
        конфиденциальности применяется только к сайту https://.langy.su и
        поддоменам. Интернет-сайт langy.su не несет ответственность за сайты
        третьих лиц, на которые Покупатель может перейти по ссылкам, доступным
        на сайте langy.su. 5.4. Продавец, в силу специфики способа получения
        информации, не проверяет достоверность предоставленных Покупателем
        персональных данных и не осуществляет контроль их актуальности. Однако,
        Продавец исходит из того, что Покупатель предоставляет достоверные
        персональные данные и поддерживает эти данные в актуальном состоянии.
        Всю ответственность, а также возможные последствия за предоставление
        недостоверных или не актуальных персональных данных несёт Покупатель.
        5.5. Отключение Сookies может повлечь невозможность доступа к частям
        сайта langy.su, требующим авторизации. 5.6. Интернет-сайт langy.su
        осуществляет сбор статистики об IP-адресах своих Покупателей. Данная
        информация используется с целью выявления и решения технических проблем,
        для контроля законности проводимых финансовых платежей. 5.7. К настоящей
        Политике конфиденциальности и отношениям между Покупателем и Продавцом
        применяется действующее законодательство Республики Казахстан. 5.8.
        Продавец оставляет за собой право на одностороннее изменение настоящей
        Политики конфиденциальности для дальнейшего совершенствования системы
        безопасности в соответствии с действующим законодательством РК. 5.9. Все
        предложения или вопросы по поводу настоящей Политики конфиденциальности
        следует сообщать по адресу: admin@langy.su. 5.10. Продавец не несет
        ответственности за действия третьих лиц, получивших в результате
        использования Интернета доступ к информации о Покупателе, за последствия
        использования информации, которая доступна любому пользователю сети
        Интернет.
      </div>
    </>
  );
}
