export const audioTexts = {
    1: 'My family',
    2: 'My flat',
    3: 'My day',
    4: 'My hobby',
    5: 'My hometown',
    6: 'Higher education',
    7: 'My pet',
    8: 'My favoorite subject',
    9: 'My weekends',
    10: 'My free time',
    11: 'Reading in my life',
    12: 'My future profession',
    13: 'Visiting a doctor',
    14: 'Visiting a theater',
    15: 'Health',
    16: 'Art',
    17: 'The UK',
    18: 'The USA',
    19: 'Education in the UK',
    20: 'Education in the USA',
    21: 'The New York city',
    22: 'Four seasons',
    23: 'Global warming',
    24: 'Environmental pollution'
}

export const videoTopics = {
    1: 'Articles / Артикли'
}

export const writingtasks = {
    1: 'Пожалуйста напишите короткое эссе на тему "Моя семья" (около 150 слов)',
    2: 'Пожалуйста напишите короткое эссе на тему "Моя квартира" (около 150 слов)',
    3: 'Пожалуйста напишите короткое эссе на тему "Мой день" (около 150 слов)',
    4: 'Пожалуйста напишите короткое эссе на тему "Моё хобби" (около 150 слов)',
    5: 'Пожалуйста напишите короткое эссе на тему "Мой город" (около 150 слов)',
    6: 'Пожалуйста напишите короткое эссе на тему "Мой университет" (около 150 слов)',
    7: 'Пожалуйста напишите короткое эссе на тему "Мой питомец" (около 150 слов)',
    8: 'Пожалуйста напишите короткое эссе на тему "Мой любимый предмет" (около 150 слов)',
    9: 'Пожалуйста напишите короткое эссе на тему "Мои выходные" (около 150 слов)',
    10: 'Пожалуйста напишите короткое эссе на тему "Мой свободное время" (около 150 слов)',
    11: 'Пожалуйста напишите короткое эссе на тему "Моя любимая книга" (около 150 слов)',
    12: 'Пожалуйста напишите короткое эссе на тему "Моя профессия" (около 150 слов)',
    13: 'Пожалуйста напишите короткое эссе на тему "Визит в кино" (около 150 слов)',
    14: 'Пожалуйста напишите короткое эссе на тему "Визит к доктору" (около 150 слов)',
    15: 'Пожалуйста напишите короткое эссе на тему "Здоровье" (около 150 слов)',
    16: 'Пожалуйста напишите короткое эссе на тему "Мой свободное время" (около 150 слов)',
    17: 'Пожалуйста напишите короткое эссе на тему "Моя страна" (около 150 слов)',
    18: 'Пожалуйста напишите короткое эссе на тему "США" (около 150 слов)',
    19: 'Пожалуйста напишите короткое эссе на тему "Высшее образование в моей стране" (около 150 слов)',
    20: 'Пожалуйста напишите короткое эссе на тему "Важность знаний" (около 150 слов)',
    21: 'Пожалуйста напишите короткое эссе на тему "Мой любимый город" (около 150 слов)',
    22: 'Пожалуйста напишите короткое эссе на тему "Как я провожу лето" (около 150 слов)',
    23: 'Пожалуйста напишите короткое эссе на тему "Глобальное потепление" (около 150 слов)',
    24: 'Пожалуйста напишите короткое эссе на тему "Экология" (около 150 слов)',
}

